; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-8nodes-1000size-3degree-100mindistance-2trucks-2packages-533seed

(define (problem transport-two-cities-sequential-8nodes-1000size-3degree-100mindistance-2trucks-2packages-533seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  city-1-loc-8 - location
  city-2-loc-8 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 707,379 -> 386,175
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 38)
  ; 386,175 -> 707,379
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 38)
  ; 422,687 -> 265,894
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 26)
  ; 265,894 -> 422,687
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 26)
  ; 51,500 -> 422,687
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 42)
  ; 422,687 -> 51,500
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 42)
  ; 364,289 -> 386,175
  (road city-1-loc-6 city-1-loc-1)
  (= (road-length city-1-loc-6 city-1-loc-1) 12)
  ; 386,175 -> 364,289
  (road city-1-loc-1 city-1-loc-6)
  (= (road-length city-1-loc-1 city-1-loc-6) 12)
  ; 364,289 -> 707,379
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 36)
  ; 707,379 -> 364,289
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 36)
  ; 364,289 -> 422,687
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 41)
  ; 422,687 -> 364,289
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 41)
  ; 364,289 -> 51,500
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 38)
  ; 51,500 -> 364,289
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 38)
  ; 608,800 -> 265,894
  (road city-1-loc-7 city-1-loc-3)
  (= (road-length city-1-loc-7 city-1-loc-3) 36)
  ; 265,894 -> 608,800
  (road city-1-loc-3 city-1-loc-7)
  (= (road-length city-1-loc-3 city-1-loc-7) 36)
  ; 608,800 -> 422,687
  (road city-1-loc-7 city-1-loc-4)
  (= (road-length city-1-loc-7 city-1-loc-4) 22)
  ; 422,687 -> 608,800
  (road city-1-loc-4 city-1-loc-7)
  (= (road-length city-1-loc-4 city-1-loc-7) 22)
  ; 974,799 -> 608,800
  (road city-1-loc-8 city-1-loc-7)
  (= (road-length city-1-loc-8 city-1-loc-7) 37)
  ; 608,800 -> 974,799
  (road city-1-loc-7 city-1-loc-8)
  (= (road-length city-1-loc-7 city-1-loc-8) 37)
  ; 2790,858 -> 2526,925
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 28)
  ; 2526,925 -> 2790,858
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 28)
  ; 2747,123 -> 2358,137
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 39)
  ; 2358,137 -> 2747,123
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 39)
  ; 2756,660 -> 2526,925
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 36)
  ; 2526,925 -> 2756,660
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 36)
  ; 2756,660 -> 2790,858
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 21)
  ; 2790,858 -> 2756,660
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 21)
  ; 2395,355 -> 2358,137
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 23)
  ; 2358,137 -> 2395,355
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 23)
  ; 2395,355 -> 2747,123
  (road city-2-loc-6 city-2-loc-4)
  (= (road-length city-2-loc-6 city-2-loc-4) 43)
  ; 2747,123 -> 2395,355
  (road city-2-loc-4 city-2-loc-6)
  (= (road-length city-2-loc-4 city-2-loc-6) 43)
  ; 2051,336 -> 2358,137
  (road city-2-loc-7 city-2-loc-3)
  (= (road-length city-2-loc-7 city-2-loc-3) 37)
  ; 2358,137 -> 2051,336
  (road city-2-loc-3 city-2-loc-7)
  (= (road-length city-2-loc-3 city-2-loc-7) 37)
  ; 2051,336 -> 2395,355
  (road city-2-loc-7 city-2-loc-6)
  (= (road-length city-2-loc-7 city-2-loc-6) 35)
  ; 2395,355 -> 2051,336
  (road city-2-loc-6 city-2-loc-7)
  (= (road-length city-2-loc-6 city-2-loc-7) 35)
  ; 2436,722 -> 2526,925
  (road city-2-loc-8 city-2-loc-1)
  (= (road-length city-2-loc-8 city-2-loc-1) 23)
  ; 2526,925 -> 2436,722
  (road city-2-loc-1 city-2-loc-8)
  (= (road-length city-2-loc-1 city-2-loc-8) 23)
  ; 2436,722 -> 2790,858
  (road city-2-loc-8 city-2-loc-2)
  (= (road-length city-2-loc-8 city-2-loc-2) 38)
  ; 2790,858 -> 2436,722
  (road city-2-loc-2 city-2-loc-8)
  (= (road-length city-2-loc-2 city-2-loc-8) 38)
  ; 2436,722 -> 2756,660
  (road city-2-loc-8 city-2-loc-5)
  (= (road-length city-2-loc-8 city-2-loc-5) 33)
  ; 2756,660 -> 2436,722
  (road city-2-loc-5 city-2-loc-8)
  (= (road-length city-2-loc-5 city-2-loc-8) 33)
  ; 2436,722 -> 2395,355
  (road city-2-loc-8 city-2-loc-6)
  (= (road-length city-2-loc-8 city-2-loc-6) 37)
  ; 2395,355 -> 2436,722
  (road city-2-loc-6 city-2-loc-8)
  (= (road-length city-2-loc-6 city-2-loc-8) 37)
  ; 974,799 <-> 2051,336
  (road city-1-loc-8 city-2-loc-7)
  (= (road-length city-1-loc-8 city-2-loc-7) 118)
  (road city-2-loc-7 city-1-loc-8)
  (= (road-length city-2-loc-7 city-1-loc-8) 118)
  (at package-1 city-1-loc-8)
  (at package-2 city-1-loc-5)
  (at truck-1 city-2-loc-8)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-8)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-6)
  (at package-2 city-2-loc-7)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-8 city-2-loc-6)
   deleted: (at truck-1 city-2-loc-8)
   added: (at truck-1 city-2-loc-6)
   goals met: 0 of 2
2. (drive truck-1 city-2-loc-6 city-2-loc-7)
   deleted: (at truck-1 city-2-loc-6)
   added: (at truck-1 city-2-loc-7)
   goals met: 0 of 2
3. (drive truck-1 city-2-loc-7 city-1-loc-8)
   deleted: (at truck-1 city-2-loc-7)
   added: (at truck-1 city-1-loc-8)
   goals met: 0 of 2
4. (pick-up truck-1 city-1-loc-8 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-8) (capacity truck-1 capacity-4)
   added: (in package-1 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 2
5. (drive truck-1 city-1-loc-8 city-1-loc-7)
   deleted: (at truck-1 city-1-loc-8)
   added: (at truck-1 city-1-loc-7)
   goals met: 0 of 2
6. (drive truck-1 city-1-loc-7 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-7)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 2
7. (drive truck-1 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 2
8. (pick-up truck-1 city-1-loc-5 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-5) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 2
9. (drive truck-1 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 2
10. (drive truck-1 city-1-loc-4 city-1-loc-7)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-7)
   goals met: 0 of 2
11. (drive truck-1 city-1-loc-7 city-1-loc-8)
   deleted: (at truck-1 city-1-loc-7)
   added: (at truck-1 city-1-loc-8)
   goals met: 0 of 2
12. (drive truck-1 city-1-loc-8 city-2-loc-7)
   deleted: (at truck-1 city-1-loc-8)
   added: (at truck-1 city-2-loc-7)
   goals met: 0 of 2
13. (drop truck-1 city-2-loc-7 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-2)
   added: (at package-2 city-2-loc-7) (capacity truck-1 capacity-3)
   goals met: 1 of 2
14. (drive truck-1 city-2-loc-7 city-2-loc-6)
   deleted: (at truck-1 city-2-loc-7)
   added: (at truck-1 city-2-loc-6)
   goals met: 1 of 2
15. (drop truck-1 city-2-loc-6 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-3)
   added: (at package-1 city-2-loc-6) (capacity truck-1 capacity-4)
   goals met: 2 of 2
